robot_rules = {
    "НАЧАЛО": [["start", "ПРАВИЛО1", "stop"]],
    "ПРАВИЛО1": [["ПРАВИЛО1", "ПРАВИЛО4", "ПРАВИЛО2"], ["ПРАВИЛО2"]],
    "ПРАВИЛО2": [["ПРАВИЛО2", "ПРАВИЛО5", "ПРАВИЛО3"], ["ПРАВИЛО3"]],
    "ПРАВИЛО3": [["left"], ["right"], ["on45", "ПРАВИЛО3"], ["hands_up", "ПРАВИЛО1", "hands_down"]],
    "ПРАВИЛО4": [["step_", "(", "ПРАВИЛО6", ")"]],
    "ПРАВИЛО5": [["turn_head"]],
    "ПРАВИЛО6": [["digt"], ["digt", "ПРАВИЛО6"]],
}

monkey_rules = {
    "Правило1": [["Правило1", "ау", "Правило2"], ["Правило2"]],
    "Правило2": [["Правило2", "ку", "Правило3"], ["Правило3"]],
    "Правило3": [["ух-ты"], ["хо", "Правило3"], ["ну", "Правило1", "и_ну"]],
}

__all__ = ["robot_rules", "monkey_rules"]